[
    {
        "field_name": "obs_general_id",
        "field_type": "uint4",
        "field_key": "foreign",
        "field_key_foreign": [
            "obs_general",
            "id"
        ],
        "field_notnull": true,
        "data_source": "OBS_GENERAL_ID",
        "comments": "This is the primary (surrogate) key linking the record to obs_general."
    },
    {
        "field_name": "opus_id",
        "field_type": "char50",
        "field_key": "foreign",
        "field_key_foreign": [
            "obs_general",
            "opus_id"
        ],
        "field_notnull": true,
        "data_source": "COMPUTE",
        "comments": "This is the secondary key linking the record to obs_general."
    },
    {
        "field_name": "bundle_id",
        "field_type": "char75",
        "field_key": true,
        "field_notnull": true,
        "data_source": "COMPUTE",
        "comments": "The bundle_id is included here for ease of database manipulation only."
    },
    {
        "field_name": "instrument_id",
        "field_type": "char60",
        "field_key": false,
        "field_notnull": true,
        "data_source": "COMPUTE",
        "comments": "The instrument_id is included here for ease of database manipulation only."
    },
    {
        "field_name": "planetocentric_latitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "PLANETOCENTRIC_LATITUDE",
        "definition": "The range of planetocentric latitudes in the field of view. Planetocentric latitude is the latitude at the surface intercept point on the planet or a specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the body intercept point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. Note that, for a given surface intercept point on a non-spherical body, the planetocentric latitude is smaller in magnitude than the planetographic latitude. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Both the minimum and maximum planetocentric latitudes are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_PLANETOCENTRIC_LATITUDE",
        "definition_results": "The minimum planetocentric latitude in the field of view. Planetocentric latitude is the latitude at the surface intercept point on the planet or a specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the body intercept point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. Note that, for a given surface intercept point on a non-spherical body, the planetocentric latitude is smaller in magnitude than the planetographic latitude. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 400,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Observed Planetocentric Latitude",
        "pi_label_results": "Observed Planetocentric Latitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>planetocentriclatitude1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_planetocentriclatitude1",
        "pi_sub_heading": "Planetocentric Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "planetocentric_latitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_PLANETOCENTRIC_LATITUDE",
        "definition_results": "The maximum planetocentric latitude in the field of view. Planetocentric latitude is the latitude at the surface intercept point on the planet or a specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the body intercept point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. Note that, for a given surface intercept point on a non-spherical body, the planetocentric latitude is smaller in magnitude than the planetographic latitude. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 401,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Observed Planetocentric Latitude",
        "pi_label_results": "Observed Planetocentric Latitude (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>planetocentriclatitude2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_planetocentriclatitude2",
        "pi_sub_heading": "Planetocentric Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "planetographic_latitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "PLANETOGRAPHIC_LATITUDE",
        "definition": "The range of planetographic latitudes in the field of view. Planetographic latitude is the latitude at the surface intercept point on the planet or a specified target body. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the body intercept point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. Note that, for a given surface intercept point on a non-spherical body, the planetographic latitude is larger in magnitude than the planetocentric latitude. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Both the minimum and maximum planetographic latitudes are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_PLANETOGRAPHIC_LATITUDE",
        "definition_results": "The minimum planetographic latitude in the field of view. Planetographic latitude is the latitude at the surface intercept point on the planet or a specified target body. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the body intercept point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. Note that, for a given surface intercept point on a non-spherical body, the planetographic latitude is larger in magnitude than the planetocentric latitude. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 300,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Observed Planetographic Latitude",
        "pi_label_results": "Observed Planetographic Latitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>planetographiclatitude1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_planetographiclatitude1",
        "pi_sub_heading": "Planetographic Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "planetographic_latitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_PLANETOGRAPHIC_LATITUDE",
        "definition_results": "The maximum planetographic latitude in the field of view. Planetographic latitude is the latitude at the surface intercept point on the planet or a specified target body. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the body intercept point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. Note that, for a given surface intercept point on a non-spherical body, the planetographic latitude is larger in magnitude than the planetocentric latitude. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 301,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Observed Planetographic Latitude",
        "pi_label_results": "Observed Planetographic Latitude (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>planetographiclatitude2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_planetographiclatitude2",
        "pi_sub_heading": "Planetographic Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "iau_west_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "IAU_WEST_LONGITUDE",
        "definition": "The range of IAU longitudes in the field of view. IAU longitude is the longitude at the surface intercept point on the planet or a specified target body. Longitudes increase toward the west, in the rotating coordinate frame defined by the IAU. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Note that IAU longitude wraps around from 360 to 0 and thus both minimum and maximum values must be specified for a valid search. OPUS will also allow you to search from a larger number to a smaller number, implying the IAU longitude must wrap around. Both the minimum and maximum IAU longitudes are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_IAU_WEST_LONGITUDE",
        "definition_results": "The minimum IAU longitude in the field of view. IAU longitude is the longitude at the surface intercept point on the planet or a specified target body. Longitudes increase toward the west, in the rotating coordinate frame defined by the IAU. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. For fields of view that cross the prime meridian, the tabulated minimum value will be greater than the maximum.",
        "pi_disp_order": 500,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Observed IAU West Longitude",
        "pi_label_results": "Observed IAU West Longitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>IAUwestlongitude1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_IAUwestlongitude1",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "iau_west_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_IAU_WEST_LONGITUDE",
        "definition_results": "The maximum IAU longitude in the field of view. IAU longitude is the longitude at the surface intercept point on the planet or a specified target body. Longitudes increase toward the west, in the rotating coordinate frame defined by the IAU. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. For fields of view that cross the prime meridian, the tabulated minimum value will be greater than the maximum.",
        "pi_disp_order": 501,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": null,
        "pi_label": "Observed IAU West Longitude",
        "pi_label_results": "Observed IAU West Longitude (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>IAUwestlongitude2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_IAUwestlongitude2",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "iau_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_iau_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "iau_east_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "IAU_EAST_LONGITUDE",
        "definition": "The range of IAU east longitudes in the field of view. IAU east longitude is the longitude at the surface intercept point on the planet or a specified target body. Longitudes increase toward the east, in the rotating coordinate frame defined by the IAU. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Note that IAU east longitude wraps around from 360 to 0 and thus both minimum and maximum values must be specified for a valid search. OPUS will also allow you to search from a larger number to a smaller number, implying the IAU east longitude must wrap around. Both the minimum and maximum IAU east longitudes are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_IAU_EAST_LONGITUDE",
        "definition_results": "The minimum IAU east longitude in the field of view. IAU east longitude is the longitude at the surface intercept point on the planet or a specified target body. Longitudes increase toward the east, in the rotating coordinate frame defined by the IAU. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. For fields of view that cross the prime meridian, the tabulated minimum value will be greater than the maximum.",
        "pi_disp_order": 550,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Observed IAU East Longitude",
        "pi_label_results": "Observed IAU East Longitude (Min)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_IAUeastlongitude1",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "iau_east_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_IAU_EAST_LONGITUDE",
        "definition_results": "The maximum IAU east longitude in the field of view. IAU east longitude is the longitude at the surface intercept point on the planet or a specified target body. Longitudes increase toward the east, in the rotating coordinate frame defined by the IAU. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. For fields of view that cross the prime meridian, the tabulated minimum value will be greater than the maximum.",
        "pi_disp_order": 551,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": null,
        "pi_label": "Observed IAU East Longitude",
        "pi_label_results": "Observed IAU East Longitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_IAUeastlongitude2",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "iau_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_iau_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": false,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "solar_hour_angle1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "LOCAL_HOUR_ANGLE",
        "definition": "The range of local hour angles in the field of view. Local hour angle is a measure of the local solar time as observed at the surface intercept point on the planet or a specified target body. The value is 180 degrees at a point on the surface as the Sun is crossing the local meridian. Local hour angle can alternatively be understood as a longitude frame that originates at the anti-solar direction and increases toward the east (assuming prograde rotation). The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored. Note that right local hour angle wraps around from 360 to 0 and thus both minimum and maximum values must be specified for a valid search. OPUS will also allow you to search from a larger number to a smaller number, implying the local hour angle must wrap around. Both the minimum and maximum local hour angles are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_LOCAL_HOUR_ANGLE",
        "definition_results": "The minimum local hour angle in the field of view. Local hour angle is a measure of the local solar time as observed at the surface intercept point on the planet or a specified target body. The value is 180 degrees at a point on the surface as the Sun is crossing the local meridian. Local hour angle can alternatively be understood as a longitude frame that originates at the anti-solar direction and increases toward the east (assuming prograde rotation). The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored. For fields of view that cross the midnight meridian, the tabulated minimum value will be greater than the maximum.",
        "pi_disp_order": 740,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:hour_angle",
        "pi_intro": "Because local time wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Observed Local Hour Angle",
        "pi_label_results": "Observed Local Hour Angle (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>solarhourangle1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_solarhourangle1",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "solar_hour_angle2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_LOCAL_HOUR_ANGLE",
        "definition_results": "The maximum local hour angle in the field of view. Local hour angle is a measure of the local solar time as observed at the surface intercept point on the planet or a specified target body. The value is 180 degrees at a point on the surface as the Sun is crossing the local meridian. Local hour angle can alternatively be understood as a longitude frame that originates at the anti-solar direction and increases toward the east (assuming prograde rotation). The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored. For fields of view that cross the midnight meridian, the tabulated minimum value will be greater than the maximum.",
        "pi_disp_order": 741,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:hour_angle",
        "pi_intro": null,
        "pi_label": "Observed Local Hour Angle",
        "pi_label_results": "Observed Local Hour Angle (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>solarhourangle2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_solarhourangle2",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "solar_hour_angle",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_solar_hour_angle",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "observer_west_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -180,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "WEST_LONGITUDE_WRT_OBSERVER",
        "definition": "The range of longitudes with respect to the observer in the field of view. This alternative definition of longitude is measured relative to the direction toward the observer. Values increase westward. Unlike other longitudes, this quantity ranges from -180 to 180 degrees instead of 0 to 360 degrees. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Note that longitude wraps around from 180 to -180 and thus both minimum and maximum values must be specified for a valid search. OPUS will also allow you to search from a larger number to a smaller number, implying the longitude must wrap around. Both the minimum and maximum longitudes are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_WEST_LONGITUDE_WRT_OBSERVER",
        "definition_results": "The minimum longitude with respect to the observer in the field of view. This alternative definition of longitude is measured relative to the direction toward the observer. Values increase westward. Unlike other longitudes, this quantity ranges from -180 to 180 degrees instead of 0 to 360 degrees. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 530,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "West Longitude WRT Observer",
        "pi_label_results": "West Longitude WRT Observer (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>observerlongitude1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_observerlongitude1",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "observer_west_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -180,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_WEST_LONGITUDE_WRT_OBSERVER",
        "definition_results": "The maximum longitude with respect to the observer in the field of view. This alternative definition of longitude is measured relative to the direction toward the observer. Values increase westward. Unlike other longitudes, this quantity ranges from -180 to 180 degrees instead of 0 to 360 degrees. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 531,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": null,
        "pi_label": "West Longitude WRT Observer",
        "pi_label_results": "West Longitude WRT Observer (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>observerlongitude2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_observerlongitude2",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "observer_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_observer_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "observer_east_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -180,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "EAST_LONGITUDE_WRT_OBSERVER",
        "definition": "The range of longitudes with respect to the observer in the field of view. This alternative definition of longitude is measured relative to the direction toward the observer. Values increase eastward. Unlike other longitudes, this quantity ranges from -180 to 180 degrees instead of 0 to 360 degrees. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Note that longitude wraps around from 180 to -180 and thus both minimum and maximum values must be specified for a valid search. OPUS will also allow you to search from a larger number to a smaller number, implying the longitude must wrap around. Both the minimum and maximum longitudes are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_EAST_LONGITUDE_WRT_OBSERVER",
        "definition_results": "The minimum longitude with respect to the observer in the field of view. This alternative definition of longitude is measured relative to the direction toward the observer. Values increase eastward. Unlike other longitudes, this quantity ranges from -180 to 180 degrees instead of 0 to 360 degrees. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 580,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "East Longitude WRT Observer",
        "pi_label_results": "East Longitude WRT Observer (Min)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_observereastlongitude1",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "observer_east_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -180,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_EAST_LONGITUDE_WRT_OBSERVER",
        "definition_results": "The maximum longitude with respect to the observer in the field of view. This alternative definition of longitude is measured relative to the direction toward the observer. Values increase eastward. Unlike other longitudes, this quantity ranges from -180 to 180 degrees instead of 0 to 360 degrees. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 581,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": null,
        "pi_label": "East Longitude WRT Observer",
        "pi_label_results": "East Longitude WRT Observer (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_observereastlongitude2",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "observer_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_observer_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "finest_resolution1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "FINEST_SURFACE_RESOLUTION",
        "definition": "The range of finest surface resolutions in the field of view. Finest surface resolution is the shorter dimension of a pixel as projected onto the surface at the intercept point. In practice, it defines the approximate size of the smallest linear feature that can be resolved if that feature is oriented optimally on the surface. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Both the minimum and maximum finest surface resolutions are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_FINEST_SURFACE_RESOLUTION",
        "definition_results": "The minimum finest surface resolution in the field of view, in other words the size of the smallest resolvable feature. Finest surface resolution is the shorter dimension of a pixel as projected onto the surface at the intercept point. In practice, it defines the approximate size of the smallest linear feature that can be resolved if that feature is oriented optimally on the surface. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 620,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.5f:distance_resolution",
        "pi_intro": null,
        "pi_label": "Finest Observed Resolution",
        "pi_label_results": "Finest Observed Resolution (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>finestresolution1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_finestresolution1",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "finest_resolution2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_FINEST_SURFACE_RESOLUTION",
        "definition_results": "The maximum finest surface resolution in the field of view, in other words the smallest resolvable feature that could be resolved anywhere in the field of view provided that feature is oriented optimally on the surface. Finest surface resolution is the shorter dimension of a pixel as projected onto the surface at the intercept point. In practice, it defines the approximate size of the smallest linear feature that can be resolved if that feature is oriented optimally on the surface. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 621,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.5f:distance_resolution",
        "pi_intro": null,
        "pi_label": "Finest Observed Resolution",
        "pi_label_results": "Finest Observed Resolution (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>finestresolution2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_finestresolution2",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "coarsest_resolution1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_sentinel": -999,
        "val_set_invalid_to_null": true,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "COARSEST_SURFACE_RESOLUTION",
        "definition": "The range of coarsest surface resolutions in the field of view. Coarsest surface resolution is the longer dimension of a pixel as projected onto the surface at the intercept point. At any given intercept point, the coarsest surface resolution is typically larger than the finest resolution by a factor of 1/cos(emission angle). In practice, this defines the approximate size of a linear feature that can be resolved if that feature has its worst possible orientation on the surface. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Both the minimum and maximum coarsest surface resolutions are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_COARSEST_SURFACE_RESOLUTION",
        "definition_results": "The minimum coarsest surface resolution in the field of view, in other words the size of the smallest feature that could be resolved somewhere within the field of view, even if its orientation on the surface is the worst it can be. Coarsest surface resolution is the longer dimension of a pixel as projected onto the surface at the intercept point. At any given intercept point, the coarsest surface resolution is typically larger than the finest resolution by a factor of 1/cos(emission angle). In practice, this defines the approximate size of a linear feature that can be resolved if that feature has its worst possible orientation on the surface. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 630,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.5f:distance_resolution",
        "pi_intro": null,
        "pi_label": "Coarsest Observed Resolution",
        "pi_label_results": "Coarsest Observed Resolution (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>coarsestresolution1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_coarsestresolution1",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file. Val_max is set to be ~7 times the diameter of Jupiter for sanity."
    },
    {
        "field_name": "coarsest_resolution2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_sentinel": -999,
        "val_set_invalid_to_null": true,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_COARSEST_SURFACE_RESOLUTION",
        "definition_results": "The maximum coarsest surface resolution in the field of view, in other words the size of the smallest feature that could be resolved anywhere in the field of view and regardless of its orientation on the surface. Coarsest surface resolution is the longer dimension of a pixel as projected onto the surface at the intercept point. At any given intercept point, the coarsest surface resolution is typically larger than the finest resolution by a factor of 1/cos(emission angle). In practice, this defines the approximate size of a linear feature that can be resolved if that feature has its worst possible orientation on the surface. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 631,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.5f:distance_resolution",
        "pi_intro": null,
        "pi_label": "Coarsest Observed Resolution",
        "pi_label_results": "Coarsest Observed Resolution (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>coarsestresolution2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_coarsestresolution2",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file.  Val_max is set to be ~7 times the diameter of Jupiter for sanity."
    },
    {
        "field_name": "range_to_body1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SURFACE_DISTANCE",
        "definition": "The range of surface distances in the field of view. Surface distance is the separation between the observer and the point where a line of sight intercepts the surface of the planet or a specified target body. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored. Both the minimum and maximum surface distances are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SURFACE_DISTANCE",
        "definition_results": "The minimum surface distance in the field of view. Surface distance is the separation between the observer and the point where a line of sight intercepts the surface of the planet or a specified target body. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 600,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:distance",
        "pi_intro": null,
        "pi_label": "Observed Distance to Surface",
        "pi_label_results": "Observed Distance to Surface (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>rangetobody1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_rangetobody1",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "range_to_body2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SURFACE_DISTANCE",
        "definition_results": "The maximum surface distance in the field of view. Surface distance is the separation between the observer and the point where a line of sight intercepts the surface of the planet or a specified target body. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. For observations capturing reflected sunlight (i.e., with wavelengths in the visual or near-infrared), the night side of the target body is also ignored.",
        "pi_disp_order": 601,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:distance",
        "pi_intro": null,
        "pi_label": "Observed Distance to Surface",
        "pi_label_results": "Observed Distance to Surface (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>rangetobody2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_rangetobody2",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "phase1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "PHASE_ANGLE",
        "definition": "The range of phase angles in the field of view. Phase angle is the angle, measured at the surface intercept point, between the direction of the incoming photon from the Sun and the direction of the outgoing photon to the observer. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored. Both the minimum and maximum phase angles are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_PHASE_ANGLE",
        "definition_results": "The minimum phase angle in the field of view. Phase angle is the angle, measured at the surface intercept point, between the direction of the incoming photon from the Sun and the direction of the outgoing photon to the observer. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored.",
        "pi_disp_order": 710,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Observed Phase Angle",
        "pi_label_results": "Observed Phase Angle (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>phase1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_phase1",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "phase2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_PHASE_ANGLE",
        "definition_results": "The maximum phase angle in the field of view. Phase angle is the angle, measured at the surface intercept point, between the direction of the incoming photon from the Sun and the direction of the outgoing photon to the observer. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored.",
        "pi_disp_order": 711,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Observed Phase Angle",
        "pi_label_results": "Observed Phase Angle (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>phase2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_phase2",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "incidence1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "INCIDENCE_ANGLE",
        "definition": "The range of incidence angles in the field of view. Incidence angle is the angle, measured at the surface intercept point, between the local surface normal vector and the direction of the incoming photon from the Sun. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored. Both the minimum and maximum incidence angles are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_INCIDENCE_ANGLE",
        "definition_results": "The minimum incidence angles in the field of view. Incidence angle is the angle, measured at the surface intercept point, between the local surface normal vector and the direction of the incoming photon from the Sun. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored.",
        "pi_disp_order": 720,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Observed Incidence Angle",
        "pi_label_results": "Observed Incidence Angle (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>incidence1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_incidence1",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "incidence2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_INCIDENCE_ANGLE",
        "definition_results": "The maximum incidence angles in the field of view. Incidence angle is the angle, measured at the surface intercept point, between the local surface normal vector and the direction of the incoming photon from the Sun. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored.",
        "pi_disp_order": 721,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Observed Incidence Angle",
        "pi_label_results": "Observed Incidence Angle (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>incidence2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_incidence2",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "emission1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "EMISSION_ANGLE",
        "definition": "The range of emission angles in the field of view. Emission angle is the angle, measured at the surface intercept point, between the local surface normal vector and the direction of the outgoing photon to the observer. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored. Both the minimum and maximum emission angles are stored for each observation and the search can be made more specific using the any/all/only modifiers. See Help/FAQ for more information.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_EMISSION_ANGLE",
        "definition_results": "The minimum emission angle in the field of view. Emission angle is the angle, measured at the surface intercept point, between the local surface normal vector and the direction of the outgoing photon to the observer. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored.",
        "pi_disp_order": 730,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Observed Emission Angle",
        "pi_label_results": "Observed Emission Angle (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>emission1",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_emission1",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "emission2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_EMISSION_ANGLE",
        "definition_results": "The maximum emission angle in the field of view. Emission angle is the angle, measured at the surface intercept point, between the local surface normal vector and the direction of the outgoing photon to the observer. The surface has been modeled as an ellipsoid. Surface intercept points that are obscured by the planet or another moon within the observed field of view are ignored. The night side of the target body is not ignored.",
        "pi_disp_order": 731,
        "pi_display": 0,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Observed Emission Angle",
        "pi_label_results": "Observed Emission Angle (Max)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>emission2",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_emission2",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_planetocentric_latitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_SOLAR_PLANETOCENTRIC_LATITUDE",
        "definition": "The range of planetocentric latitudes of the sub-solar point on the surface of the planet or specified target body in the observation. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the sub-solar point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_SOLAR_PLANETOCENTRIC_LATITUDE",
        "definition_results": "The minimum planetocentric latitude of the sub-solar point on the surface of the planet or specified target body in the observation. Planetocentric latitude of the sub-solar point on the surface of the planet or specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the sub-solar point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 410,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Solar Planetocentric Latitude",
        "pi_label_results": "Sub-Solar Planetocentric Latitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subsolarplanetocentriclatitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarplanetocentriclatitude1",
        "pi_sub_heading": "Planetocentric Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_planetocentric_latitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_SOLAR_PLANETOCENTRIC_LATITUDE",
        "definition_results": "The maximum planetocentric latitude of the sub-solar point on the surface of the planet or specified target body in the observation. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the sub-solar point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 411,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Solar Planetocentric Latitude",
        "pi_label_results": "Sub-Solar Planetocentric Latitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarplanetocentriclatitude2",
        "pi_sub_heading": "Planetocentric Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_planetographic_latitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_SOLAR_PLANETOGRAPHIC_LATITUDE",
        "definition": "The range of planetographic latitudes of the sub-solar point on the surface of the planet or specified target body in the observation. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the sub-solar point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_SOLAR_PLANETOGRAPHIC_LATITUDE",
        "definition_results": "The minimum planetographic latitude of the sub-solar point on the surface of the planet or specified target body in the observation. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the sub-solar point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 310,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Solar Planetographic Latitude",
        "pi_label_results": "Sub-Solar Planetographic Latitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subsolarplanetographiclatitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarplanetographiclatitude1",
        "pi_sub_heading": "Planetographic Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_planetographic_latitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_SOLAR_PLANETOGRAPHIC_LATITUDE",
        "definition_results": "The maximum planetographic latitude of the sub-solar point on the surface of the planet or specified target body in the observation. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the sub-solar point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 311,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Solar Planetographic Latitude",
        "pi_label_results": "Sub-Solar Planetographic Latitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarplanetographiclatitude2",
        "pi_sub_heading": "Planetographic Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_planetocentric_latitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_OBSERVER_PLANETOCENTRIC_LATITUDE",
        "definition": "The range of planetocentric latitudes of the sub-observer point on the surface of the planet or specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the sub-observer point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_OBSERVER_PLANETOCENTRIC_LATITUDE",
        "definition_results": "The minimum planetocentric latitude of the sub-observer point on the surface of the planet or specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the sub-observer point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 420,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Observer Planetocentric Latitude",
        "pi_label_results": "Sub-Observer Planetocentric Latitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subobserverplanetocentriclatitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverplanetocentriclatitude1",
        "pi_sub_heading": "Planetocentric Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_planetocentric_latitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_OBSERVER_PLANETOCENTRIC_LATITUDE",
        "definition_results": "The maximum planetocentric latitude of the sub-observer point on the surface of the planet or specified target body. The planetocentric value is defined by the angle from the body's equator plane to a line defined by a vector from the body center to the sub-observer point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 421,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Observer Planetocentric Latitude",
        "pi_label_results": "Sub-Observer Planetocentric Latitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverplanetocentriclatitude2",
        "pi_sub_heading": "Planetocentric Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_planetographic_latitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_OBSERVER_PLANETOGRAPHIC_LATITUDE",
        "definition": "The range of planetographic latitudes of the sub-observer point on the surface of the planet or specified target body. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the sub-observer point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "MINIMUM_SUB_OBSERVER_PLANETOGRAPHIC_LATITUDE",
        "definition": "The minimum planetographic latitude of the sub-observer point on the surface of the planet or specified target body. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the sub-observer point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 320,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Observer Planetographic Latitude",
        "pi_label_results": "Sub-Observer Planetographic Latitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subobserverplanetographiclatitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverplanetographiclatitude1",
        "pi_sub_heading": "Planetographic Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_planetographic_latitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": -90,
        "val_max": 90,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "MAXIMUM_SUB_OBSERVER_PLANETOGRAPHIC_LATITUDE",
        "definition": "The maximum planetographic latitude of the sub-observer point on the surface of the planet or specified target body. The planetographic value is defined by the angle between the body's equator plane and the local surface normal at the sub-observer point. Values are positive in the body's northern hemisphere and negative in the southern hemisphere. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 321,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:latitude",
        "pi_intro": null,
        "pi_label": "Sub-Observer Planetographic Latitude",
        "pi_label_results": "Sub-Observer Planetographic Latitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverplanetographiclatitude2",
        "pi_sub_heading": "Planetographic Latitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_iau_west_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_SOLAR_IAU_WEST_LONGITUDE",
        "definition": "The range of longitudes of the sub-solar point on the surface of the planet or specified target body. Longitudes increase toward the west from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_SOLAR_IAU_WEST_LONGITUDE",
        "definition_results": "The minimum longitude of the sub-solar point on the surface of the planet or specified target body. Longitudes increase toward the west from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 510,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Solar IAU West Longitude",
        "pi_label_results": "Sub-Solar IAU West Longitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subsolarIAUlongitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarIAUlongitude1",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_iau_west_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_SOLAR_IAU_WEST_LONGITUDE",
        "definition_results": "The maximum longitude of the sub-solar point on the surface of the planet or specified target body. Longitudes increase toward the west from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 511,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Solar IAU West Longitude",
        "pi_label_results": "Sub-Solar IAU West Longitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarIAUlongitude2",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_iau_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_sub_solar_iau_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "sub_solar_iau_east_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_SOLAR_IAU_EAST_LONGITUDE",
        "definition": "The range of longitudes of the sub-solar point on the surface of the planet or specified target body. Longitudes increase toward the east from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_SOLAR_IAU_EAST_LONGITUDE",
        "definition_results": "The minimum longitude of the sub-solar point on the surface of the planet or specified target body. Longitudes increase toward the east from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 560,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Solar IAU East Longitude",
        "pi_label_results": "Sub-Solar IAU East Longitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subsolarIAUeastlongitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarIAUeastlongitude1",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_iau_east_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_SOLAR_IAU_EAST_LONGITUDE",
        "definition_results": "The maximum longitude of the sub-solar point on the surface of the planet or specified target body. Longitudes increase toward the east from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 561,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Solar IAU East Longitude",
        "pi_label_results": "Sub-Solar IAU East Longitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subsolarIAUeastlongitude2",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_solar_iau_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_sub_solar_iau_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "sub_observer_iau_west_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_OBSERVER_IAU_WEST_LONGITUDE",
        "definition": "The range of longitudes of the sub-observer point on the surface of the planet or specified target body in the observation. Longitudes increase toward the west from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_OBSERVER_IAU_WEST_LONGITUDE",
        "definition_results": "The minimum longitude of the sub-observer point on the surface of the planet or specified target body in the observation. Longitudes increase toward the west from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 520,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Observer IAU West Longitude",
        "pi_label_results": "Sub-Observer IAU West Longitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subobserverIAUlongitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverIAUlongitude1",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_iau_west_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_OBSERVER_IAU_WEST_LONGITUDE",
        "definition_results": "The maximum longitude of the sub-observer point on the surface of the planet or specified target body in the observation. Longitudes increase toward the west from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 521,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Observer IAU West Longitude",
        "pi_label_results": "Sub-Observer IAU West Longitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverIAUlongitude2",
        "pi_sub_heading": "West Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_iau_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_sub_observer_iau_west_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "sub_observer_iau_east_longitude1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "SUB_OBSERVER_IAU_EAST_LONGITUDE",
        "definition": "The range of longitudes of the sub-observer point on the surface of the planet or specified target body in the observation. Longitudes increase toward the east from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_SUB_OBSERVER_IAU_EAST_LONGITUDE",
        "definition_results": "The minimum longitude of the sub-observer point on the surface of the planet or specified target body in the observation. Longitudes increase toward the east from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 570,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Observer IAU East Longitude",
        "pi_label_results": "Sub-Observer IAU East Longitude (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_subobserverIAUeastlongitude",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverIAUeastlongitude1",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_iau_east_longitude2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 360,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_SUB_OBSERVER_IAU_EAST_LONGITUDE",
        "definition_results": "The maximum longitude of the sub-observer point on the surface of the planet or specified target body in the observation. Longitudes increase toward the east from the IAU-defined prime meridian. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 571,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "LONG%.3f:longitude",
        "pi_intro": "Because longitude wraps around, both min and max must be specified for a meaningful result",
        "pi_label": "Sub-Observer IAU East Longitude",
        "pi_label_results": "Sub-Observer IAU East Longitude (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_subobserverIAUeastlongitude2",
        "pi_sub_heading": "East Longitude",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "sub_observer_iau_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 360
    },
    {
        "field_name": "d_sub_observer_iau_east_longitude",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "D_LONGITUDE_FIELD",
        "val_min": 0,
        "val_max": 180
    },
    {
        "field_name": "center_resolution1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "CENTER_RESOLUTION",
        "definition": "The range of linear sizes of a pixel as projected at the distance of the planet or specified target body in the observation. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_CENTER_RESOLUTION",
        "definition_results": "The minimum linear size of a pixel as projected at the distance of the planet or specified target body in the observation. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 640,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.5f:distance_resolution",
        "pi_intro": null,
        "pi_label": "Body Center Resolution",
        "pi_label_results": "Body Center Resolution (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_centerresolution",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_centerresolution1",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "center_resolution2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_CENTER_RESOLUTION",
        "definition_results": "The maximum linear size of a pixel as projected at the distance of the planet or specified target body in the observation. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 641,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.5f:distance_resolution",
        "pi_intro": null,
        "pi_label": "Body Center Resolution",
        "pi_label_results": "Body Center Resolution (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_centerresolution2",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "center_distance1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "CENTER_DISTANCE",
        "definition": "The range of distances from the observer to the center of the planet or a specified target body in the observation. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_CENTER_DISTANCE",
        "definition_results": "The minimum distances from the observer to the center of the planet or a specified target body in the observation. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 610,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:distance",
        "pi_intro": null,
        "pi_label": "Body Center Distance",
        "pi_label_results": "Body Center Distance (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_centerdistance",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_centerdistance1",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "center_distance2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 1e18,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_CENTER_DISTANCE",
        "definition_results": "The maximum distances from the observer to the center of the planet or a specified target body in the observation. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 611,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:distance",
        "pi_intro": null,
        "pi_label": "Body Center Distance",
        "pi_label_results": "Body Center Distance (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_centerdistance2",
        "pi_sub_heading": "Distance & Resolution",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "center_phase_angle1",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context": "SURFACE_GEO",
        "pi_dict_name": "CENTER_PHASE_ANGLE",
        "definition": "The range of phase angles at the center of the planet or specified target body in the observation. This is the angle between the local direction of in incoming photon from the Sun and the local direction of an outgoing photon to the observer. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MINIMUM_CENTER_PHASE_ANGLE",
        "definition_results": "The minimum phase angle at the center of the planet or specified target body in the observation. This is the angle between the local direction of in incoming photon from the Sun and the local direction of an outgoing photon to the observer. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 700,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Phase Angle at Body Center",
        "pi_label_results": "Phase Angle at Body Center (Min)",
        "pi_old_slug": "SURFACEGEO<SLUGTARGET>_centerphaseangle",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_centerphaseangle1",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "center_phase_angle2",
        "field_type": "real8",
        "field_default": null,
        "field_key": true,
        "data_source": "COMPUTE",
        "val_min": 0,
        "val_max": 180,
        "val_sentinel": -999,
        "pi_category_name": "obs_surface_geometry__<TARGET>",
        "pi_dict_context_results": "SURFACE_GEO",
        "pi_dict_name_results": "MAXIMUM_CENTER_PHASE_ANGLE",
        "definition_results": "The maximum phase angle at the center of the planet or specified target body in the observation. This is the angle between the local direction of in incoming photon from the Sun and the local direction of an outgoing photon to the observer. This value is defined by the geometry during the time of the observation; it is independent of the field of view.",
        "pi_disp_order": 701,
        "pi_display": 1,
        "pi_display_results": 1,
        "pi_form_type": "RANGE%.3f:generic_angle",
        "pi_intro": null,
        "pi_label": "Phase Angle at Body Center",
        "pi_label_results": "Phase Angle at Body Center (Max)",
        "pi_slug": "SURFACEGEO<SLUGTARGET>_centerphaseangle2",
        "pi_sub_heading": "Lighting Geometry",
        "pi_tooltip": "",
        "comments": "Definition is from SURFACE_GEO label file."
    },
    {
        "field_name": "id",
        "field_type": "uint4",
        "field_key": "primary",
        "field_notnull": true,
        "data_source": "MAX_ID"
    },
    {
        "field_name": "timestamp",
        "field_type": "timestamp",
        "field_notnull": true
    }
]
